#编写应用于R软件的GM(1,1)模型
gm11<-function(x0,t){ #x0为输入学列，t为预测个数
x1<-cumsum(x0) #一次累加生成序列1-AG0序列
b<-numeric(length(x0)-1)
n<-length(x0)-1
for(i in 1:n){ #生成x1的紧邻均值生成序列
b[i]<--(x1[i]+x1[i+1])/2 
b} #得序列b，即为x1的紧邻均值生成序列
D<-numeric(length(x0)-1)
D[]<-1
B<-cbind(b,D)
BT<-t(B)#做逆矩阵
M<-solve(BT%*%B)
YN<-numeric(length(x0)-1)
YN<-x0[2:length(x0)]
alpha<-M%*%BT%*%YN  #模型的最小二乘估计参数列满足alpha尖
alpha2<-matrix(alpha,ncol=1)
a<-alpha2[1]
u<-alpha2[2]
cat("GM(1,1)参数估计值：",'\n',"发展系数-a=",-a,"  ","灰色作用量u=",u,'\n','\n') #利用最小二乘法求得参数估计值a,u
y<-numeric(length(c(1:t)))
y[1]<-x1[1]
for(w in 1:(t-1)){  #将a,u的估计值代入时间响应序列函数计算x1拟合序列y
y[w+1]<-(x1[1]-u/a)*exp(-a*w)+u/a 
}
cat("x(1)的模拟值：",'\n',y,'\n')
xy<-numeric(length(y))
xy[1]<-y[1]
for(o in 2:t){ #运用后减运算还原得模型输入序列x0预测序列
xy[o]<-y[o]-y[o-1] 
} 
cat("x(0)的模拟值：",'\n',xy,'\n','\n')                       

#计算残差e
e<-numeric(length(x0))
for(l in 1:length(x0)){
e[l]<-x0[l]-xy[l] #得残差
}
cat("残差：",'\n',e,'\n')
#计算相对误差
e2<-numeric(length(x0))
for(s in 1:length(x0)){
e2[s]<-(abs(e[s])/x0[s]) #得相对误差
}
cat("相对残差：",'\n',e2,'\n','\n')
cat("残差平方和=",sum(e^2),'\n')
cat("平均相对误差=",sum(e2)/(length(e2)-1)*100,"%",'\n')
cat("相对精度=",(1-(sum(e2)/(length(e2)-1)))*100,"%",'\n','\n')

#后验差比值检验
avge<-mean(abs(e));esum<-sum((abs(e)-avge)^2);evar=esum/(length(e)-1);se=sqrt(evar)  #计算残差的方差se
avgx0<-mean(x0);x0sum<-sum((x0-avgx0)^2);x0var=x0sum/(length(x0));sx=sqrt(x0var)  #计算原序列x0的方差sx
cv<-se/sx  #得验差比值
cat("后验差比值检验:",'\n',"C值=",cv,'\n')#对后验差比值进行检验，与一般标准进行比较判断预测结果好坏。
if(cv < 0.35){     
cat("C值<0.35, GM(1,1)预测精度等级为：好",'\n','\n')
}else{
if(cv<0.5){
cat("C值属于[0.35,0.5), GM(1,1)模型预测精度等级为：合格",'\n','\n')
}else{
if(cv<0.65){
cat("C值属于[0.5,0.65), GM(1,1)模型预测精度等级为：勉强合格",'\n','\n')
}else{
cat("C值>=0.65, GM(1,1)模型预测精度等级为：不合格",'\n','\n')
}
}
}
#画出输入序列x0的预测序列及x0的比较图像
plot(xy,col='blue',type='b',pch=16,xlab='时间序列(始于2000年)',ylab='第一主成分')
points(x0,col='red',type='b',pch=4)
legend('topleft',c('预测数量','原始数量'),pch=c(16,4),lty=l,col=c('blue','red'))
}
#a<-c(9.431174418,11.08166498,13.42571683,13.67367111,17.3241572,18.48019474,20.71151975,22.07472217,25.55958223,26.34468547,29.06276018,32.83015092) #B第1
#a<-c(21.41306192,20.86062825,19.8389605,19.96813638,18.7949184,18.81116793,19.05015851,20.09993717,19.81374222,20.2181477,19.78696412,21.3441769) #B第2
#gm11(a,length(a)+4)


#a<-c(8.348220366,10.95651801,14.23131658,15.15564726,18.24317046,20.19393746,21.74278117,22.81887275,24.74463616,25.49977628,27.79786637,30.26725713)#S第1
#a<-c(20.55940232,20.11455505,20.13481566,19.29046898,20.23829156,19.95336209,19.67863425,19.23152457,19.94539828,19.70831877,20.38169587,20.76353261)#S第3
#gm11(a,length(a)+4)


a<-c(10.45795,13.188,15.13468,13.99504,17.92789,18.83529,19.98623,21.246009,24.012998,24.869483,27.797926,32.54851) #天津第1
a<-c(19.85462,19.67137,19.35888,24.028711,18.87893,19.04782,18.92368,18.81742,18.8392,21.027336,20.95887,20.593156) #天津第2
gm11(a,length(a)+4)